In [2]:
import pandas as pd

In [3]:
data=[4,8,15,16,23,42]

In [4]:
df=pd.DataFrame(data)

In [5]:
df

    0
0   4
1   8
2  15
3  16
4  23
5  42

In [7]:
list_=[1,2,3,4,5,6,7,8,9]

In [8]:
df=pd.DataFrame(list_)

In [9]:
df

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [10]:
df1={"Name":['Alice','Bob','Claire'],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]}

In [11]:
mv=pd.DataFrame(df1)

In [12]:
mv

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [13]:
#comman functions is head(),tail(),describe(),sort_values(),groupby(),fillna()

In [16]:
mv

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [17]:
mv.head(1)

    Name  Age  Gender
0  Alice   25  Female

In [18]:
mv.tail(2)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

In [19]:
mv.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [ ]:
#In Pandas, both Series and DataFrame are mutable in nature, while Panel is immutable.

#A mutable object can be modified after its creation, allowing changes to its values, structure, or other properties. On the other hand, an immutable object cannot be modified once it is created; any operation on it creates a new object.

#1.panel
#2.Series
#3.dataFrame

In [23]:
data101={
    "name":['mayank',"alak sir","sudhanshu sir"],
    "gender":['male','male','male'],
    "age":[19,35,32]
}

In [24]:
df=pd.DataFrame(data101)

In [25]:
df

            name gender  age
0         mayank   male   19
1       alak sir   male   35
2  sudhanshu sir   male   32